import React from "react";
import "./Mission.css";

function Mission() {
    return(
    <div className="mission">
        <h3>مهمتنا</h3>
        <p>نحن هنا لدعمك في كل خطوة على الطريق. رغم أن منصتنا في عامها الأول، إلا أننا نعمل مع فريق من المحامين الخبراء في مختلف التخصصات القانونية لتحقيق أفضل النتائج لعملائنا.
        نحن ملتزمون بتوفير العدالة التي تستحقها. هدفنا هو تسهيل الوصول إلى المحامين المتميزين وتقديم الدعم القانوني الذي يلبي احتياجاتك الشخصية.
        نحن هنا لمساعدتك - سواء كان لديك قضية مرورية، حادث بين مركبة ومشاة، حادث دراجة نارية، أو أي مسألة قانونية أخرى، منصة محاميك هنا لتقديم استشارات قانونية وحلول عملية.
        </p>
    </div>
    );
}

export default Mission;